Update architecture diagram in README
